
def 첫인사(name):
    print("안녕하십니까")
    print("저는 개발 부서에 지원하는", name, "입니다.")

def 본문(학과명):
    print("저는", 학과명 ,"학과를 전공하며 다양한 대외활동을 수행하였고")
    print("팀의 목표 달성을 위해 개인의 손익을 감수하면서 팀의 성과를 위해 노력했으며")
    print("결과는 물론 제 성과 기여도에 대해 팀원들에게도 인정받았습니다.")
    print("저를 대표하는 2가지 키워드는 '끈기'과 '성실' 입니다.")
    print("이 회사에 근무하며 어려운 프로젝트에도 거침없이 도전하여")
    print("많은 성과를 내고자 합니다.")

def 끝인사(num):
    print("제가 가진 이 역량을 바탕으로 귀사의 도전에 동참하고 싶습니다.")
    print("이상으로 지원번호",num,"번 이었습니다.")
    print("감사합니다.")


첫인사("이름")
본문("컴퓨터공")
끝인사(1004)